package javaStudy;

//자바의 기본: 키워드(보라색-다크모드에서는 다홍색)를 변수/클래스명으로 사용할 수 없음.
//아래 public은 있어도 없어도 그만~
//모든 키워드, 클래스 이름 중간에는 공백이 반드시 들어가야 인식함. 공백이 없으면 하나의 단어로 인식함.
// 클래스 이름 옆에는 반드시 {}를 사용함. 클래스 옆에 붙은 클래스 정의부(클래스 바디)라고 부름.
//클래스 이름 첫자는 반드시 대문자로 시작(반드시!!)
//한글 사용 X
//클래스명에 특문은 숫자, $, _만 허용됨. 단, 숫자는 가장 앞에 올 수 없음.(컴파일 에러 남)
//자바는 문법에 엄격! 모든 실행, 선언, 초기화 구문 끝에 반드시 ; 사용할 것.
//하나의 자바 소스 파일 내에는 하나 이상의 클래스를 정의할 수 있음. 단 public은 단 하나의 키워드만 가질 수 있음.(2번 이상 사용 시 에러)
//public을 가진 클래스가 대표 클래스. main method를 가지며, 파일명을 이 클래스명으로 함.

class $0me_C1s{
}

public class SyntaxEx {
	
}
